[
    {
        "content": "Democrats who are pushing for the impeachment of President Donald Trump will have $110 million to spend on the cause, thanks to the efforts of left-wing billionaire Tom Steyer.\nSteyer’s organizations, NextGen America and Need to Impeach, will also have a combined 1,000 employees and 2,000 staffers as they take the case for impeachment to voters in November, according to Politico. Though House Minority Leader Nancy Pelosi (D-CA) has discouraged impeachment talk, grass roots Democrats favor the idea.\n\nPolitico reports:\n\nTom Steyer plans to spend at least $110 million in 2018, making the billionaire investor the largest single source of campaign cash on the left and placing him on a path to create a parallel party infrastructure with polling, analytics and staffing capabilities that stand to shape and define the issues the party runs on in November.\n\nSteyer is building out an operation that’s bigger than anyone’s other than the Koch brothers’ — and the billionaire and his aides believe the reservoir of nontraditional voters he’s already activated could become the overriding factor in House and other races across the country.\n\nBetween the two organizations, he’ll have close to 1,000 people on staff, in addition to over 2,000 volunteers. The Need to Impeach email list alone has already topped 5.5 million, which its research — anyone who signs up with the effort has their information run through a series of voter files and other databases — shows includes a very exact 697,780 infrequent voters in the 63 most competitive House districts.\n\n“Our list is bigger than the NRA’s — and we’re going to make sure that it votes that way in 2018,” said Kevin Mack, lead strategist for Need to Impeach.\n\nSteyer claimed earlier this year that Democrats must embrace impeachment if they want to win the midterm elections and return to power. Politico adds that Steyer’s internal polls show that Republican voters are not yet motivated by the desire to prevent Trump from being impeached — which has been a major fear of the Democratic Party establishment, which has tried to suppress the idea.\n\nSteyer, who has already spent tens of millions of dollars on pro-impeachment advertising, will hope for a better return on his investments than he experienced in 2014, when he spent roughly $75 million, only to see Republicans take the Senate.\n\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.",
        "title": "Democrats’ Impeachment Army: $110 Million, 1000 Staff, 2000 Volunteers",
        "url": "https://www.breitbart.com/big-government/2018/07/31/democrats-impeachment-army-110-million-1000-staff-2000-volunteers/"
    },
    {
        "content": "All of Washington is wondering what comes next, following the bombshell guilty plea Tuesday by President Trump’s former personal lawyer Michael Cohen to charges of violating federal campaign finance laws in an effort to help Trump win the 2016 presidential election.\n\nCohen entered his plea in U.S. District Court in New York City. He stated that candidate Trump directed him to coordinate payments to two women during the 2016 presidential race to keep them from publicizing claims that they had affairs with Trump, because the candidate feared the allegations by the women would harm his election chances.\n\n“I participated in this conduct … for the principal purpose of influencing the election,” Cohen said in his guilty plea.\n\nPresident Trump has repeatedly denied he had affairs with the women – the porn star known as Stormy Daniels (whose real name is Stephanie Clifford) and former Playboy model Karen McDougal.\n\nDaniels received a payment of $130,000 from Cohen. McDougal received a payment of $150,000 from American Media Inc., the parent company of the National Enquirer, for the rights to her story. However, the magazine never published her story. The chairman of American Media is David Pecker, a longtime friend of Trump.\n\nPresident Trump launches Twitter offensive against the special counsel investigation; chief White House correspondent John Roberts reports.\nIn addition to pleading guilty to causing an illegal corporate campaign contribution and making an excessive campaign contribution, Cohen pleaded guilty to one count of making a false statement to a bank and five counts of tax evasion.\n\nThe Cohen pleas on the campaign finance law violations mean two things.\n\nFirst, it is unlikely Cohen has any information to offer Special Counsel Robert Mueller about allegations that Trump or his presidential campaign colluded with Russia to help Trump defeat Democratic candidate Hillary Clinton in the presidential race two years ago. If Cohen did have such information, his guilty plea on the campaign finance violations and other charges would likely have been delayed.\n\nAnd second, Cohen’s claim that he engaged in shady dealings by doing Trump’s bidding in coordinating the payments to the two women will figure in Mueller’s eventual report to Congress on the Russia investigation. The Mueller report is likely to be seized upon by Trump opponents as grist for their drive to impeach the president if Democrats win a majority of U.S. House seats in the November midterm election.\n\nThere is very little chance that President Trump will face charges over the payments that Cohen admitted to coordinating.\n\nIn a similar case, former Sen. John Edwards of North Carolina – the 2004 Democratic nominee for vice president – was indicted by the Justice Department over payments some of his supporters made to his mistress when Edwards ran for president in 2008. Edwards was prosecuted on six counts. He was acquitted on one and the jury couldn’t decide on the other five.\n\nIt was generally conceded at the time that the prosecution of Edwards was a fiasco, because prosecutors found it impossible to prove that the purpose of the Edwards payments was political, rather than simply an effort to keep his terminally ill wife from learning that he had an extramarital affair and fathered a child with his mistress.\n\nAs Bob Bauer, who served as White House counsel for President Barack Obama, has observed: “Only a motivation materially if not wholly shaped by political objectives would implicate federal campaign finance law in a situation like this.”\n\nSo while it’s unlikely that President Trump will face legal charges for his alleged role in the Cohen payments, that doesn’t mean there will not be future damage to the president, who is no ordinary client.\n\nBauer said that the Cohen case is “about the most powerful man in the country – who prosecutors have observed displaying contempt for legal considerations and constraints, and consistently lying about his actions.”\n\nMueller and his prosecutors are intent on showing that President Trump committed obstruction of justice early in his administration to avoid scrutiny of aspects of his 2016 campaign. The need to avoid such a minefield is one reason that Trump lawyers don’t want to subject the president to an interview with the Mueller team.\n\nMueller will likely find it very difficult to make an obstruction case against the president, but that won’t deter him them from filing a report to the Justice Department on his investigation that will inevitably leak. Even if that report doesn’t lead to impeachment of the president, you can bet it will be seized upon by the president’s enemies in the run-up to any Trump re-election campaign.\n\nSo the ultimate outcome of the Mueller probe may be a classic Pyrrhic victory for Trump – a victory that comes at a very steep cost. There will be little if any evidence of any collusion between the Trump campaign and Kremlin actors. But the further reputational damage the Mueller report will leave may hurt the president with some of his soft supporters and motivate his opponents to attack him with greater ferocity.\n\nDonald Trump’s policies are fueling a growing economy and many of his policies cheer conservatives. But a Mueller report accusing Trump of wrongdoing would, even if biased, no doubt call into question the president’s judgment.\n\nTrump, after all, made the decision to make Paul Manafort – a sleazy lobbyist convicted Tuesday of tax evasion and bank fraud – chairman of the Trump 2016 presidential campaign. Trump also hired Omarosa Manigault Newman, an outrageous version of a cartoon villain, for his White House staff. How did that work out?\n\nAnd now, Trump’s longtime personal lawyer, Michael Cohen, has been revealed as a sleaze whose clumsy deceptions leave even New York shyster lawyers shaking their heads.\n\nI believe Donald Trump will survive the Mueller probe, which will have its own ethical problems regarding bias and prosecutorial abuse to answer for. But the picture it is likely to paint of our president will ask his supporters to do a lot of heavy lifting when they come to his defense.",
        "title": "Trump likely safe after Cohen guilty plea, but Mueller report will be fodder for foes",
        "url": "http://www.foxnews.com/opinion/2018/08/22/trump-likely-safe-after-cohen-guilty-plea-but-mueller-report-will-be-fodder-for-foes.html"
    },
    {
        "content": "Michael Cohen's guilty plea, in a matter of hours, has kicked up speculation about Democratic impeachment efforts against President Trump, as lawmakers declare the president is now implicated in a criminal conspiracy.\n\nFormer Trump lawyer Cohen pleaded guilty to campaign finance violations, saying Trump directed hush money to two women who claimed affairs with him.\n\nWhile the president and his allies deny Trump is in any legal trouble, the controversy raised concerns on the right that Democrats will use the issue to pursue impeachment should they reclaim the House majority.\n\n“The framers of the Constitution provided impeachment as the way to remove an unfit President,” longtime impeachment supporter Rep. Al Green, D-Texas, tweeted on Wednesday. “The ultimate question is, does Congress have the will?”\n\n\nTop Democratic leaders aren't all following suit. But Rep. Jerrold Nadler, D-N.Y., who as ranking Democrat on the House Judiciary Committee would likely play a pivotal role in any impeachment effort, said in a statement that, \"The President of the United States is now directly implicated in a criminal conspiracy.”\n\nHe added, \"[T]he Judiciary Committee has real work to do.\n\n\"The Congress stands at a crossroads. Democrats are poised to take action to respond to this culture of corruption that has taken hold under Mr. Trump and Republican Congressional Majorities. It is not too late for my Republican colleagues to put our country ahead of their politics and join us in our work.\"\n\nOn 'America's Newsroom,' the attorney for Michael Cohen says there's 'no question' that President Trump committed a federal crime by directing and coordinating hush money payments by his client.\nAsked about the impeachment talk, Nadler told The New York Times he needs to see more evidence from the special counsel probe, but added, “We may get there.”\n\nRep. Elijah Cummings, D-Md., top Democrat on the oversight committee, also called for a congressional hearing with Cohen.\n\nOther top Democrats have remained quiet on the possibility of pursuing Trump impeachment.\n\nHouse Democratic Leader Nancy Pelosi of California on Wednesday said that impeaching Trump is \"not a priority\" for her party and that she prefers for Democrats, if they win the House in November, to conduct oversight and ensure Special Counsel Robert Mueller can finish his work.\n\n\"[I]mpeachment has to spring from something else,” she told reporters. \"If and when the information emerges about that, we'll see. It's not a priority on the agenda going forward unless something else comes forward.\"\n\nSen. Dick Durbin, D-Ill., said on Wednesday that it is too early to talk about impeachment, but added that the country is on “the verge of constitutional crisis.”\n\n“I think the first conversation is about the seriousness of what happened yesterday,” Durbin said. “We are on the threshold of a constitutional crisis.”\n\nDurbin added: “To have the president’s personal counsel suggest that he was directed by the president to commit an act which led to a plea of guilty ... is a serious allegation.”\n\nMeanwhile, billionaire former hedge fund manager and founder of the group Need to Impeach, Tom Steyer, launched a media blitz following Tuesday’s news. Steyer’s group quickly put out a digital ad about impeaching Trump and is working on a similar ad for television.\n\n“The evidence continues to mount up,” Steyer said in a video. “The question is, when will Congress pay attention?”\n\nMost Republican lawmakers on Capitol Hill deflected from answering questions about the possibility of impeachment.\n\n“That is in hands of prosecutor that is working its way through courts,” Sen. Marco Rubio, R-Fla., said when questioned if Trump committed a crime by allegedly ordering the hush money to be paid. “They will handle that and prosecutor’s office will handle that if someone is accused of something they have the right to defend themselves.”\n\nSen. Orrin Hatch, R-Utah, said he wouldn’t judge whether Cohen’s implication of Trump in the hush money scandal was more serious than the allegations leveled against former President Bill Clinton that led to his impeachment hearings, but that he doesn’t see impeachment as a serious matter currently.\n\n“Not at this point,” Hatch said. “But we have to take these matters very seriously.”\n\nIn regards to the impeachment proceedings brought against Clinton, one longtime Republican senator’s words came back to haunt him on Tuesday.\n\nMSNBC commentator Lawrence O’Donnell posted a video of now-Sen. Lindsey Graham, R-S.C., speaking on the floor as one of the prosecutors in the House of Representatives’ case for removing Clinton from office.\n\n“You don’t even have to be convicted of a crime to lose your job in this constitutional republic if this body determines your conduct as a public official is clearly out of bounds in your role,” the then-congressman says in the nearly 20-year-old clip.\n\n\n“Because impeachment is not about punishment,” he said. “Impeachment is about cleansing the office. Impeachment is about restoring honor and integrity to the office.”\n\nThe clip quickly spread across social media with Trump critics asking if he still believes in that standard.\n\nIn the hours after the news broke about Cohen and ex-Trump campaign chairman Paul Manafort's conviction, Trump and White House staffers went on the offensive, with Trump slamming Cohen during a speech in West Virginia and tweeting on Wednesday that Cohen \"plead[ed] guilty to two counts of campaign finance violations that are not a crime. President Obama had a big campaign finance violation and it was easily settled!\"\n\nTrump appeared to be referencing that Obama's 2008 campaign was fined $375,000 by the Federal Election Commission for reporting violations that stemmed from missing notices for donations received during the final days of the campaign.\n\nNearly a dozen people close to the president, including current and former White House aides, told Politico that Tuesday was one of the darkest days of Trump’s presidency and that many are worried the revelations will bolster support for Mueller’s investigation into Russian meddling in the 2016 elections.\n\n“There was political momentum building to wrap up the Mueller probe soon,” a former administration official told Politico. “At the very least, in the short term, these two developments will pretty significantly bolster the office of the special counsel and people’s perceptions of it.”\n\nDespite the talk of impeachment, some experts say there is not enough evidence to impeach Trump.\n\n“We’re far away from [an] impeachable offense or a criminal offense on the part of the president,” Harvard Law professor emeritus Alan Dershowitz said.",
        "title": "Michael Cohen plea deal fuels Trump impeachment frenzy",
        "url": "http://www.foxnews.com/politics/2018/08/22/michael-cohen-plea-deal-fuels-trump-impeachment-frenzy.html"
    },
    {
        "content": "In a taped interview with Fox & Friends that aired Thursday morning, President Trump mused about his own impeachment. “I guess it says something like ‘high crimes’ and all,” Trump said, showing a typically deep understanding of the Constitution. “I don’t know how you can impeach somebody who’s done a great job.” Trump added, with a bit of menace, that attempting to remove him from office would tank the economy: “If I ever got impeached, I think the market would crash. I think everybody would be very poor.”\n\nThe president of the United States has made his position on impeachment clear. It’s time that Democratic candidates for office do the same.\nThe 2018 election is not normal. The foundation of our democracy is at risk. The Republican Party has not just become corrupt; it has become lawless. The president is now an unindicted co-conspirator in a scheme involving hush money to influence his own election. His former campaign manager and deputy campaign manager are convicted felons. His first two congressional endorsers are under indictment.\nSpecial Counsel Robert Mueller’s work is far from finished, but we know that Trump’s campaign sought to collude with a Russian attack on our democracy. Trump has lied endlessly to the American people; he’s profited from the office of the presidency and he’s undermined the constitution like a strongman — bashing the free press as the “enemy of the people.” We have no idea what wretchedness transpired during his summit with Vladimir Putin in Helsinki.\nIt’s time to recognize that the 2018 midterms are not about what Nancy Pelosi and Democratic leaders wished for. It’s not about routine politics or policy. It’s not about how the House GOP’s Obamacare vote threatened people with preexisting conditions. It’s not about how the Trump tax bill is raising taxes on millions of homeowners who find their state-and-local tax deduction capped. It’s certainly not about the merits of the Democratic party’s small-ball “Better Deal” platform.\nThe 2018 election is now about standing up for the rule of law. It’s about replacing a feckless Republican majority, comprised of preening faux patriots who haven’t got the mettle to stand up to a Twitter tyrant. This is the contrast election that has been thrust upon Democrats. And it’s time to embrace it. First, because there’s no avoiding it. And second because Democrats can — and must — win the argument.\nNo president, and no party, is above the law. The Constitution tasks congress with the most difficult duty in law enforcement: policing the president. Impeachment isn’t “playing politics,” it’s solemn duty in defense of our nation. Trump has committed impeachable offenses; Mueller will likely expose more. And Congress needs to hold him to account. Because once lawlessness goes unchecked, lawlessness is permitted. And that, my fellow Americans, is a dark fucking path.\nImpeachment is about keeping faith with our founding principles. A voter who can’t trust a politician to stand up for the Constitution probably won’t trust that person to have their back on an infrastructure- or immigration-reform bill. Democratic candidates, and patriots everywhere, need to say “impeachment” out loud. Today and everyday until November — and beyond.",
        "title": "President Trump Mused About His Own Impeachment on Fox News",
        "url": "https://www.rollingstone.com/politics/politics-features/trump-fox-news-impeachment-714855/"
    },
    {
        "content": "For all of my opposition to Donald Trump, I have long been skeptical of the political wisdom or evidentiary basis of efforts to impeach him.\n\nMy reasons: First, being a terrible president and a wretched person are not impeachable offenses. Second, Robert Mueller’s investigation has so far produced evidence that can be interpreted as obstruction of justice, but not as clear proof. Third, impeachment in the House would be unlikely to translate into conviction in the Senate, even if Democrats win both chambers in the fall. Fourth, impeachment without conviction could strengthen Trump politically, much as it did for Bill Clinton after his own 1998 impeachment.\n\nAnd, like it or not, Trump remains popular with tens of millions of Americans. To overturn the results of an election for anything less than unambiguous evidence of criminal behavior is a danger to democracy itself.\n\nAt least that was my view until this week. Michael Cohen’s guilty plea changes this. The Constitution’s standard for impeachment is “Treason, Bribery, or other high Crimes and Misdemeanors.” The standard is now met.\n\nTrump’s longtime fixer acknowledged in court on Tuesday that he violated campaign finance laws by paying hush money to two women “in coordination with and at the direction of a candidate for federal office.” That means Trump. That means that, as a candidate, Trump is credibly alleged to have purposefully conspired with Cohen to commit criminal acts. That means the duo did so “for purposes of influencing [an] election for Federal office,” which is the legal definition of a campaign contribution.\n\nIt also means that, as president, Trump allegedly sought to conceal the arrangement by failing to note in his 2017 financial disclosure forms his reimbursements to Cohen. The president most likely continues to lie to the American people about the nature and purpose of those payments.\n\nThe Trumpian rebuttal to these charges is that Cohen is a sleazy lawyer and proven liar. And that the most prominent attempt to prosecute a political figure for violating campaign-finance laws — involving former Democratic senator and 2004 vice-presidential candidate John Edwards — failed in court. And that campaign-finance violations don’t rise to the level of impeachable offenses, anyway.\n\nBut if Cohen’s lies as Trump’s lawyer are one thing, lying under oath to a federal judge is quite another. Cohen’s sentencing isn’t until December, when he’s expected to be sent to prison for up to five years. If he’s being untruthful, that leaves plenty of time for any deceits to come to light. Ask yourself: Does he look like a guy eager to have his sentence doubled?\n\nTo suggest that this doesn’t amount to a felonious act also doesn’t pass the smell test. The president is now, in effect, an unindicted co-conspirator on charges already prosecuted by the government as a criminal matter against Cohen. Why should a lighter standard apply to Trump, since he’s the one at whose direction Cohen claims to have carried out the payments?\n\nThat question should especially engage those conservatives who demanded Clinton’s impeachment (as I did). Take South Carolina’s Lindsey Graham, one of the House managers overseeing the case against the 42nd president.\n\n“Twenty-five years ago,” he said that December, “a Democratic-controlled judiciary committee, with a minority of Republicans, reported articles of impeachment against Richard Nixon. Why? Nixon cheated — he cheated the electoral system by concealing efforts of a political break-in, and his people thought the other side deserved to be cheated. They thought his enemies deserved to be mistreated. Ladies and gentlemen, they were wrong.”\n\nHe continued: “Today, Republicans, with a small handful of Democrats, will vote to impeach President Clinton. Why? Because we believe he committed crimes resulting in cheating our legal system. We believe he lied under oath numerous times, that he tampered with evidence, that he conspired to present false testimony to a court of law. We believe he assaulted our legal system in every way. Let it be said that any president who cheats our institutions shall be impeached.”\n\nThe emphases here are mine. To conservatives reading this column, ask yourselves the following questions:\n\nIf breaking the law (by lying under oath) to conceal an affair was impeachable, why is breaking the law (by violating campaign-finance laws) to conceal an affair not impeachable?\n\nIf “cheating the electoral system” (by means of a burglary) was impeachable, why is cheating the electoral system (by means of illicit hush money) not impeachable?\n\nIf cheating “our institutions” (by means of an “assault” in “every way” on the legal system) is impeachable, why is cheating those institutions (by means of nonstop presidential mendacity and relentless attacks on the Justice Department and the F.B.I.) not impeachable?\n\nPragmatists will rejoin that there’s no sense in advocating impeachment when the G.O.P. controls Congress. I’m sorry that so many congressional Republicans have lost their sense of moral principle and institutional self-respect, but that’s a reason to seek Democratic victories in the fall. The Constitution matters more than a tax cut. What the Constitution demands is the impeachment and removal from office of this lawless president.",
        "title": "Donald Trump’s High Crimes and Misdemeanors",
        "url": "https://www.nytimes.com/2018/08/22/opinion/donald-trump-cohen-impeachment.html"
    }
]